Revit 2027 API
BuiltInFailures.RoomFailures.ShowRoomBoundingElements Property
 [Room] Bounding elements are highlighted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ShowRoomBoundingElements { get; }
Public Shared ReadOnly Property ShowRoomBoundingElements As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ShowRoomBoundingElements {
	FailureDefinitionId^ get ();
}
static member ShowRoomBoundingElements : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace